import { produce } from 'immer';


const BlogData = {
    posts: [
        {
            id: 1,
            title: '10 טיפים להשכרת דירה בקלות',
            excerpt: 'במאמר זה נדון בעשרה טיפים חשובים שיכולים לעזור לכם להשכיר דירה בקלות וביעילות.',
        },
        {
            id: 2,
            title: 'היתרונות של השכרת דירה לטווח קצר',
            excerpt: 'השכרת דירה לטווח קצר מציעה יתרונות רבים, כולל גמישות והכנסה נוספת.',
        },
        {
            id: 3,
            title: 'איך לבחור את הדירה המושלמת',
            excerpt: 'בחירת הדירה המושלמת יכולה להיות מאתגרת. במאמר זה נשתף טיפים חשובים.',
        },
        {
            id: 4,
            title: 'איך להיערך למעבר לדירה חדשה',
            excerpt: 'מעבר לדירה חדשה זה ממש פרויקט. במאמר זה נחלוק איתכם את הדרך לעבור בקלות.',
        },

    ]
}
const PostData = {
    currentPost: {
        id: 1,
        title: '10 טיפים להשכרת דירה בקלות',
        excerpt: 'במאמר זה נדון בעשרה טיפים חשובים שיכולים לעזור לכם להשכיר דירה בקלות וביעילות.',
        content: [
            "1. קבעו תקציב: לפני שאתם מתחילים לחפש דירה, קבעו תקציב מהו הסכום שאתם מוכנים להשקיע.",
            "2. חקרו את האזור: בדקו את השכונות השונות, תחבורה ציבורית, קרבה למקומות עבודה ועוד.",
            "3. תכננו את הצרכים שלכם: האם אתם זקוקים לדירה עם חדרים נוספים? האם אתם רוצים מרפסת?",
            "4. קראו ביקורות: חפשו ביקורות על בעל הדירה או החברה שמנהלת את הנכס.",
            "5. בצעו בדיקות: לפני שאתם חותמים על חוזה, ודאו שהדירה במצב טוב.",
            "6. הכינו את המסמכים: תכינו את כל המסמכים הנדרשים מראש כדי להקל על התהליך.",
            "7. היו מוכנים למשא ומתן: אל תהססו לנסות ולנהל משא ומתן על המחיר.",
            "8. בדקו את החוזה: קראו בעיון את כל התנאים לפני החתימה.",
            "9. קחו בחשבון עלויות נוספות: כמו דמי ניהול, חשמל, מים ועוד.",
            "10. אל תמהרו: קחו את הזמן שלכם ואל תתפשרו על מה שחשוב לכם."
        ],
    },
    posts: [
         {
            id: 1,
            title: '10 טיפים להשכרת דירה בקלות',
            excerpt: 'במאמר זה נדון בעשרה טיפים חשובים שיכולים לעזור לכם להשכיר דירה בקלות וביעילות.',
            content: [
                "1. קבעו תקציב: לפני שאתם מתחילים לחפש דירה, קבעו תקציב מהו הסכום שאתם מוכנים להשקיע.",
                "2. חקרו את האזור: בדקו את השכונות השונות, תחבורה ציבורית, קרבה למקומות עבודה ועוד.",
                "3. תכננו את הצרכים שלכם: האם אתם זקוקים לדירה עם חדרים נוספים? האם אתם רוצים מרפסת?",
                "4. קראו ביקורות: חפשו ביקורות על בעל הדירה או החברה שמנהלת את הנכס.",
                "5. בצעו בדיקות: לפני שאתם חותמים על חוזה, ודאו שהדירה במצב טוב.",
                "6. הכינו את המסמכים: תכינו את כל המסמכים הנדרשים מראש כדי להקל על התהליך.",
                "7. היו מוכנים למשא ומתן: אל תהססו לנסות ולנהל משא ומתן על המחיר.",
                "8. בדקו את החוזה: קראו בעיון את כל התנאים לפני החתימה.",
                "9. קחו בחשבון עלויות נוספות: כמו דמי ניהול, חשמל, מים ועוד.",
                "10. אל תמהרו: קחו את הזמן שלכם ואל תתפשרו על מה שחשוב לכם."
            ],
        },
         {
            id: 2,
            title: 'היתרונות של השכרת דירה לטווח קצר',
            excerpt: 'השכרת דירה לטווח קצר מציעה יתרונות רבים, כולל גמישות והכנסה נוספת.',
            content: [
                "1. גמישות: השכרת דירה לטווח קצר מאפשרת לבעלי הדירה להציע את הנכס שלהם למספר שוכרים שונים בזמן קצר.",
                "2. הכנסה נוספת: בעלי דירות יכולים להרוויח הכנסה נוספת על ידי השכרת הדירה בזמנים שבהם הם לא משתמשים בה.",
                "3. ניהול קל: ישנם פלטפורמות רבות שמקלות על ניהול השכרת דירות לטווח קצר.",
                "4. פוטנציאל גבוה: השכרת דירה לטווח קצר יכולה להניב רווחים גבוהים יותר מאשר השכרה לטווח ארוך.",
                "5. אפשרות לבדוק שוכרים: השכרת דירה לטווח קצר מאפשרת לבעלי הדירות לבדוק שוכרים שונים לפני שמחליטים להשכיר להם לטווח ארוך.",
                "6. חוויות תרבותיות: השכרת דירות לטווח קצר מאפשרת לשוכרים לחוות את התרבות המקומית בצורה טובה יותר.",
                "7. גמישות בתאריכים: בעלי דירות יכולים לבחור את התאריכים שבהם הם רוצים להשכיר את הדירה.",
                "8. פחות מחויבות: השכרת דירה לטווח קצר מצריכה פחות מחויבות מצד בעלי הדירה.",
                "9. אפשרות לשדרוגים: בעלי דירות יכולים לשדרג את הנכס שלהם בין השכרות.",
                "10. ניהול סיכונים: השכרת דירה לטווח קצר מפזרת את הסיכון על פני מספר שוכרים."
            ],
        },
       {
            id: 3,
            title: 'איך לבחור את הדירה המושלמת',
            excerpt: 'בחירת הדירה המושלמת יכולה להיות מאתגרת. במאמר זה נשתף טיפים חשובים.',
            content: [
                "1. קבעו את הצרכים שלכם: לפני הכל, חשוב לדעת מה אתם מחפשים בדירה.",
                "2. בדקו את המיקום: מיקום הדירה הוא אחד הגורמים החשובים ביותר שכדאי לשקול.",
                "3. קחו בחשבון את התקציב: קביעת תקציב מראש תעזור לכם למקד את החיפוש.",
                "4. חפשו דירות באינטרנט: השתמשו באתרי נדל\"ן כדי למצוא דירות שמתאימות לצרכים שלכם.",
                "5. בקרו בדירות: אל תסתפקו בתמונות בלבד, בקרו בדירות כדי לראות את המצב בפועל.",
                "6. בדקו את התנאים בחוזה: קראו בעיון את כל התנאים לפני החתימה.",
                "7. שאלו שאלות: אל תהססו לשאול את בעל הדירה או הסוכן שאלות לגבי הנכס.",
                "8. בדקו את הסביבה: חשוב לבדוק את השכונה ואת השירותים הסמוכים.",
                "9. קחו בחשבון את התחבורה: נגישות לתחבורה ציבורית יכולה להיות קריטית.",
                "10. אל תמהרו: קחו את הזמן שלכם בבחירת הדירה ואל תתפשרו על מה שחשוב לכם."
            ],
        },
         {
            id: 4,
            title: 'איך להיערך למעבר לדירה חדשה',
            excerpt: 'מעבר לדירה חדשה יכול להיות תהליך מורכב. במאמר זה נשתף טיפים להיערכות נכונה.',
            content: [
                "1. תכננו את המעבר: קבעו תאריך למעבר והתחילו לתכנן את התהליך.",
                "2. ארזו את הדברים מוקדם: התחילו לארוז את הדברים שלכם לפחות שבועיים לפני המעבר.",
                "3. נתקו שירותים: דאגו לנתק את כל השירותים בדירה הישנה לפני המעבר.",
                "4. חפשו חברת הובלות: קבעו עם חברת הובלות אמינה להקל על המעבר.",
                "5. בדקו את הדירה החדשה: לפני המעבר, ודאו שהדירה מוכנה ותואמת לציפיותיכם.",
                "6. העבירו כתובת: אל תשכחו לעדכן את הכתובת שלכם בכל המקומות הרלוונטיים.",
                "7. קחו בחשבון את הזמן: תכננו את הזמן שלכם כך שתהיה לכם גמישות במהלך המעבר.",
                "8. הכינו רשימה: הכינו רשימה של כל הדברים שאתם צריכים לעשות לפני המעבר.",
                "9. דאגו למקום לינה: אם המעבר לא מתבצע ביום אחד, דאגו למקום לינה זמני.",
                "10. הישארו רגועים: מעבר לדירה חדשה יכול להיות מלחיץ, אבל הישארו רגועים ותיהנו מהתהליך."
            ],
        },
    ]

}

export const BlogRedux = produce((state, action) => {
    switch (action.type) {
        case 'CREATE':
            {
                state.posts.push(action.payload)
                break;
            }
        case 'DELETE':
            {
                let index = state.posts.findIndex(action.payload)
                state.posts.splice(index, 1)
                break;
            }
        case 'UPDATE':
            {
                let post = state.posts.find(p => p.id === action.payload.id);
                post.title = action.payload.title
                post.excerpt = action.payload.excerpt
                break;
            }
        default: break;
    }
}, BlogData)


export const deletePost = (id) => {
    return { type: "DELETE", payload: id }
}
export const createPost = (post) => {
    return { type: "CREATE", payload: post }
}
export const updatePost = (post) => {
    return { type: "UPDATE", payload: post }
}
export const setCurrentPost = (postId) => {
    return { type: "SET_CURRENT_POST", payload: postId }
}
export const PostRedux = produce((state, action) => {
    switch (action.type) {
        case "SET_CURRENT_POST": {
            const post = state.posts.find((post) => post.id === action.payload);
            if (post) {
                state.currentPost = post; 
            }
            break;
        }
        default: {
            break;
        }
    }
}, PostData);
